Dlubal.RFEM5.NonlinearityType
Type of nonlinearity

Dlubal.RFEM5.NonlinearityType.UnknownNonlinearityType
Unknown nonlinearity type

Dlubal.RFEM5.NonlinearityType.NoneNonlinearityType
None

Dlubal.RFEM5.NonlinearityType.FailureIfNegativeType
Failure if negative

Dlubal.RFEM5.NonlinearityType.FailureIfPositiveType
Failure if positive

Dlubal.RFEM5.NonlinearityType.FailureAllIfNegativeType
Failure all if negative

Dlubal.RFEM5.NonlinearityType.FailureAllIfPositiveType
Failure all if positive

Dlubal.RFEM5.NonlinearityType.PartialActivityNLType
Partial activity

Dlubal.RFEM5.NonlinearityType.WorkingDiagramType
Diagram

Dlubal.RFEM5.NonlinearityType.FrictionAType
Friction A

Dlubal.RFEM5.NonlinearityType.FrictionBType
Friction B

Dlubal.RFEM5.NonlinearityType.FrictionCType
Friction C

Dlubal.RFEM5.NonlinearityType.FrictionDType
Friction D

Dlubal.RFEM5.NonlinearityType.StiffnessDiagramType
Stiffness diagram

Dlubal.RFEM5.NonlinearityType.ScaffoldingType
Scaffolding

Dlubal.RFEM5.NonlinearityType.FormFindingType
Form-finding

Dlubal.RFEM5.NonlinearityType.FixedIfNegativeType
Fixed if negative

Dlubal.RFEM5.NonlinearityType.FixedIfPositiveType
Fixed if positive

Dlubal.RFEM5.NonlinearityType.PlasticHingeNLType
Plastic hinge

Dlubal.RFEM5.NonlinearityType.ScaffoldingDiagramType
Scaffolding diagram